package cn.cuiot.dmp.common.constant;

/**
 * 定义标准模版ID，不可修改
 *
 * @Author: zc
 * @Date: 2024-09-23
 */
public class SmsStdTemplate {

    /**
     * 备注
     * 短信模板长度：6
     * 短信模板构成：x(1 管理端；2 客户端) + xx类型（顺序编号） + xxx编号（顺序编号）
     **/

    /*================================================================================================================*/
    /*===================================================管理端========================================================*/
    /*================================================================================================================*/

    /*----------------------------------------------------验证码-------------------------------------------------------*/

    /**
     * 情景：登录或修改密码时发送的验证码
     * 模板内容：您的验证码是{s12354}，验证码5分钟内有效。
     */
    public static final Integer MANAGE_LOGIN_OR_UPDATE_PASSWORD = 101001;

    /*---------------------------------------------------线索通知-------------------------------------------------------*/

    /**
     * 情景：线索分配通知：分配线索后，向被分配人发送通知
     * 模板内容：{用户名}给你分配了一条线索，线索名称：{线索名称}， 请前往智慧楼园小程序查看详情
     */
    public static final Integer MANAGE_CLUE = 102001;

    /*---------------------------------------------------公告通知-------------------------------------------------------*/

    /**
     * 情景：发布端为管理端，在公告生效开始时间，向发布组织下的人员发送公告消息
     * 模板内容：你收到一条公告通知，公告名称：{公告标题}， 请前往智慧楼园小程序查看详情
     */
    public static final Integer MANAGE_NOTICE = 103001;

    /*---------------------------------------------------工单通知-------------------------------------------------------*/

    /**
     * 情景：待审批通知：工单流转至审批节点，向审批节点人员发送通知
     * 模板内容：你有一条工单待审批，工单名称：{流程名称}，前往智慧楼园小程序查看详情
     */
    public static final Integer MANAGE_WORK_INFO_AWAIT_AUDIT = 104001;

    /**
     * 情景：待处理通知：工单流转至处理节点，向处理节点人员发送通知
     * 模板内容：你有一条工单待处理，工单名称：{流程名称}，前往智慧楼园小程序查看详情
     */
    public static final Integer MANAGE_WORK_INFO_AWAIT_HANDLE = 104002;

    /**
     * 情景：待评价通知：工单流转至评价节点，向发起人发送通知
     * 模板内容：你有一条工单待评价，工单名称：{流程名称}，前往智慧楼园小程序查看详情
     */
    public static final Integer MANAGE_WORK_INFO_AWAIT_EVALUATED = 104003;

    /**
     * 情景：工单被退回至发起节点通知：工单被退回发起节点，向发起人发送退回通知
     * 模板内容：你的工单被退回，工单名称：{流程名称}，前往智慧楼园小程序查看详情
     */
    public static final Integer MANAGE_WORK_INFO_RETURN = 104004;

    /**
     * 情景：工单被退回至审批节点通知：工单被退回审批节点，向节点人员发送退回通知
     * 模板内容：你审批的工单被退回，工单名称：{流程名称}，前往智慧楼园小程序查看详情
     */
    public static final Integer MANAGE_WORK_INFO_AUDIT_RETURN = 104005;

    /**
     * 情景：工单被退回至处理节点通知：工单被退回处理节点，向节点人员发送退回通知
     * 模板内容：你处理的工单被退回，工单名称：{流程名称}，前往智慧楼园小程序查看详情
     */
    public static final Integer MANAGE_WORK_INFO_HANDLE_RETURN = 104006;

    /**
     * 情景：工单被驳回通知：工单审批节点被驳回，向发起人发送通知
     * 模板内容：你的工单被驳回，工单名称：{流程名称}，前往智慧楼园小程序查看详情
     */
    public static final Integer MANAGE_WORK_INFO_REJECT = 104007;

    /**
     * 情景：工单被终止通知：工单被终止，包括手动终止和超时终止，向发起人发送通知
     * 模板内容：你的工单被终止，工单名称：{流程名称}，前往智慧楼园小程序查看详情
     */
    public static final Integer MANAGE_WORK_INFO_TERMINATE = 104008;

    /**
     * 情景：工单完成通知：工单完成，向发起人发送通知
     * 模板内容：你的工单已完成，工单名称：{流程名称}，前往智慧楼园小程序查看详情
     */
    public static final Integer MANAGE_WORK_INFO_COMPLETE = 104009;

    /**
     * 情景：工单抄送通知：工单流转到抄送人节点，向抄送节点人员发送通知
     * 模板内容：你的工单已完成，工单名称：{流程名称}，前往智慧楼园小程序查看详情
     */
    public static final Integer MANAGE_WORK_INFO_COMPLETE_COPY = 104010;



    /*================================================================================================================*/
    /*===================================================客户端========================================================*/
    /*================================================================================================================*/


    /*----------------------------------------------------验证码-------------------------------------------------------*/

    /**
     * 情景：登录时，发送验证码短信
     * 模板内容：您的验证码是{s12354}，验证码5分钟内有效。
     */
    public static final Integer CLIENT_LOGIN = 201001;

    /*---------------------------------------------------公告通知-------------------------------------------------------*/

    /**
     * 情景：发布端为客户端，在公告生效开始时间，向发布楼盘下的客户及用户发送公告消息
     * 模板内容：你收到一条公告通知，公告名称：{公告标题}， 请前往智慧楼园小程序查看详情
     */
    public static final Integer CLIENT_NOTICE = 202001;

    /*---------------------------------------------------工单通知-------------------------------------------------------*/

    /**
     * 情景：工单被退回至发起节点通知：工单被退回发起节点，向发起人（报单人）发送退回通知
     * 模板内容：你的工单被退回，工单名称：{流程名称}，前往智慧楼园小程序查看详情
     */
    public static final Integer CLIENT_WORK_INFO_RETURN = 203001;

    /**
     * 情景：工单被驳回通知：工单审批节点被驳回，向发起人（报单人）发送通知
     * 模板内容：你的工单被驳回，工单名称：{流程名称}，前往智慧楼园小程序查看详情
     */
    public static final Integer CLIENT_WORK_INFO_REJECT = 203002;

    /**
     * 情景：工单被终止通知：工单被终止，包括手动终止和超时终止，发起人（报单人）发送通知
     * 模板内容：你的工单被终止，工单名称：{流程名称}，前往智慧楼园小程序查看详情
     */
    public static final Integer CLIENT_WORK_INFO_TERMINATE = 203003;

    /**
     * 情景：工单完成通知：工单完成，向发起人（报单人）发送通知面
     * 模板内容：你的工单已完成，工单名称：{流程名称}，前往智慧楼园小程序查看详情
     */
    public static final Integer CLIENT_WORK_INFO_COMPLETE = 203004;

    /**
     * 情景：待评价通知：工单流转至评价节点，向发起人（报单人）发送通知
     * 模板内容：你有一条工单待评价，工单名称：{流程名称}，前往智慧楼园小程序查看详情
     */
    public static final Integer CLIENT_WORK_INFO_AWAIT_EVALUATED = 203005;

    /*---------------------------------------------------催缴通知-------------------------------------------------------*/

    /**
     * 情景：创建应收费用后，未在应收日期及时缴纳的客户会发送通知进行催缴
     * 模板内容：尊敬的客户您好，您在XXX年XXX月XXX日-XXX年XXX月XXX日，XXX（收费项目）账期已出，请在指定时间，及时缴费，如已缴费请忽略此信息。
     */
    public static final Integer CLIENT_CHARGE_COLLECTION = 204001;

    /*---------------------------------------------------账单通知-------------------------------------------------------*/

    /**
     * 情景：创建应收费用后，发送通知给客户，告知客户有那些应收费用及总应收金额
     * 模板内容：尊敬的客户您好，您在XXX年XXX月XXX日-XXX年XXX月XXX日，XXX（收费项目）账期已出，请在指定时间，及时缴费，如已缴费请忽略此信息。
     */
    public static final Integer CLIENT_CHARGE_BILL = 205001;

    /**
     * 尊敬的客户您好，您目前已有XX条费用，总计欠缴XX元，还请您及时缴费，如已完成缴费还请忽略此通知！
     */
    public static final Integer CLIENT_PAST_DUE_NOTICE = 205002;
}
